[{"tag":"p","original":" A list of top frequently asked ASP.NET interview questions and answers are given below. ","result":"Here are some commonly asked questions and answers that may come up during an interview for a position that involves working with ASP.NET."},{"tag":"p","original":" ASP stands for Active Server Pages. It is also known as classic ASP. It is a server-side technology provided by Microsoft which is used to create dynamic and user-friendly web pages. It uses different scripting languages to create dynamic web pages which can be run on any browsers.  ","result":"ASP, also known as classic ASP, is a server-side technology developed by Microsoft for creating interactive and user-friendly web pages. It utilizes various scripting languages to produce dynamic web pages that can be accessed on any web browser."},{"tag":"p","original":" ASP.Net is a specification by Microsoft which is used to create web applications and web services. It is a part of \".Net framework\". You can create ASP.Net applications in most of the .Net compatible languages like Visual Basic, C#, etc. ASP.Net provides much better performance than scripting languages.  ","result":"ASP.Net is a technology developed by Microsoft that enables web developers to create web applications and web services within the .Net framework. It supports a variety of programming languages such as C# and Visual Basic. Compared to scripting languages, ASP.Net offers higher performance capabilities."},{"tag":"p","original":" The main difference between ASP and ASP.Net is that ASP is interpreted, while ASP.Net is compiled. ASP uses VBScript, therefore when the ASP page is executed, it is interpreted. On the other hand, ASP.Net uses .Net languages like C# and VB.NET, which is compiled to Microsoft intermediate language. ","result":"ASP and ASP.Net are both popular web development frameworks, but they differ in how they are executed. While ASP uses VBScript and is interpreted when it runs, ASP.Net utilizes .Net languages such as VB.NET and C#. As a result, ASP.Net pages are compiled to Microsoft intermediate language, which is an advantage over ASP's interpreted nature."},{"tag":"p","original":" IIS stands for Internet Information Services. It is created by Microsoft to provide Internet-based services to ASP.NET Web applications. ","result":"IIS is an abbreviation for Internet Information Services. This software was developed by Microsoft to support ASP.NET web applications by providing internet-based services."},{"tag":"p","original":" Following are the main usage of IIS: ","result":"Here are the primary purposes for which IIS is used:"},{"tag":"li","original":" IIS is used to make your computer to work as a Web server and provides the functionality to develop and deploy Web applications on the server. ","result":"IIS is a software that enables your computer to function as a web server. It offers various features that facilitate the creation and deployment of web applications on the server."},{"tag":"li","original":" IIS handles the request and response cycle on the Web server. ","result":"The role of IIS (Internet Information Services) is to manage the interaction between a web server and its users by handling the request and response cycle."},{"tag":"li","original":" IIS also offers the services of SMTP and FrontPage server extensions. ","result":"In addition to providing web server functionality, IIS also includes support for SMTP (Simple Mail Transfer Protocol) and FrontPage server extensions."},{"tag":"li","original":" The SMTP is used to send emails and use FrontPage server extensions to get the dynamic features of IIS, such as form handler. ","result":"SMTP is a communication protocol used to send emails, while FrontPage server extensions utilize the dynamic features of IIS, such as form handler, to enhance web development."},{"tag":"p","original":" If a website provides content in many languages, it is known as a multilingual website. It contains multiple copies of its content and other resources, such as date and time, in different languages. ","result":"A multilingual website is one that offers its content in numerous languages. Such website has different versions of contents and resources, including date and time, offered in diverse languages."},{"tag":"p","original":" Caching is the technique which facilitates you to store frequently used items in memory so that they can be accessed more quickly. ","result":"Caching is a method that allows you to store often-used items in memory, making them readily accessible and faster to retrieve."},{"tag":"li","original":" By caching the response, your request is served by the response already stored in memory. ","result":"When you cache a response, your request is satisfied by the response that's already stored in memory."},{"tag":"li","original":" You must be very careful while choosing the items to cache because Caching incurs overhead. ","result":"It is important to exercise caution when selecting items to cache as caching comes with its own set of costs and drawbacks."},{"tag":"li","original":" A frequently used web form which data doesn't frequently change is good for caching.  ","result":"A web form that is often utilized, and has data that remains static for long periods, is ideal for caching."},{"tag":"li","original":" A cached web form freezes form?s server-side content, and changes to that content do not appear until the cache is refreshed. ","result":"When a web form is cached, it means that the server-side content of the form is stored temporarily. While the cache is active, any updates or modifications to the content will not be visible until the cache is refreshed."},{"tag":"p","original":" ASP.Net is the next generation of ASP technology platform. It is superior to ASP in the following ways: ","result":"ASP.Net is an updated technology platform that surpasses its predecessor ASP in several aspects."},{"tag":"li","original":" Configuration and Deployment are easy. ","result":"Configuration and deployment processes are simple and straightforward to complete."},{"tag":"li","original":" Object and Page caching ","result":"Rewritten: \n\nObject and page caching refers to the practice of storing frequently used data or entire web pages in a way that makes them quickly accessible. This is commonly done to reduce the amount of time it takes to retrieve data or load a web page for users, improving website performance and overall user experience. By storing data or pages in a cache, the server is able to quickly deliver the requested information to the user, thereby reducing load times and server strain."},{"tag":"p","original":" Postback is a request which is sent from a client to the server from the same page user is working with. There is an HTTP POST request mechanism in ASP.NET. It posts a complete page back to the server to refresh the whole page.  ","result":"A postback is a type of request made by a client application to the server. It is made from the same page that the user is working on. In ASP.NET, there is an HTTP POST mechanism used to initiate a postback. This causes the entire page to be sent back to the server, which refreshes the page."},{"tag":"p","original":" The \"IsPostBack\" property of page object is used to check that the page is posted back or not. ","result":"The \"IsPostBack\" attribute of the page object is utilized to verify whether the page has been posted back or not."},{"tag":"p","original":" There is a property named \"IsPostBack\" property in Post object, which can be checked to know that the page is posted back. ","result":"The Post object includes a property called \"IsPostBack\" that can be utilized to determine whether a page has been posted back."},{"tag":"p","original":"  System.Web.UI.Control  class ","result":"The System.Web.UI.Control class can be reworded as follows: The Control class of System.Web.UI is responsible for handling the base functionality and behavior of a control in ASP.NET."},{"tag":"p","original":"  ASP.NET Webforms uses the  page controller  approach for rendering layout. In this approach, every page has its controller. ","result":"The layout rendering approach used by ASP.NET Webforms is the page controller method. This entails having a controller for each page."},{"tag":"p","original":"  On the other hand, ASP.NET MVC uses the  Front Controller  approach. In this approach, there is a common controller for all pages.  ","result":"Unlike the Page Controller approach, which involves a specific controller for each page, ASP.NET MVC uses the Front Controller approach. This approach utilizes a central controller to handle all pages and their actions."},{"tag":"p","original":" The session object is used to maintain the session of each user. A session id is generated if a user enters in the application and when the user leaves the application, the session id is automatically deleted. ","result":"In software development, the session object plays a crucial role in keeping track of user sessions. When a user logs into an application, a unique session ID is generated for that user. This session ID persists throughout the user's session and is deleted when the user leaves the application. The session object helps to maintain the integrity and security of the user's session, ensuring that their data and interaction with the application are not interrupted by external factors."},{"tag":"p","original":" On the other hand, the application object is used to store the information and access variables from any page in the application.  ","result":"The global object is utilized to store data and access across all the pages of the website, while the application object serves as a container for variables that can be accessed from any page within the application."},{"tag":"p","original":" Debug class is used to debug builds. Trace class is used for both debug and release builds. ","result":"The Debug class is utilized specifically for debugging builds, while the Trace class is utilized for both debugging and release builds."},{"tag":"p","original":" The client-side validation happens at the client's side with the help of JavaScript and VBScript. This validation has occurred before the Web page is sent to the server. ","result":"Client-side validation is performed on the client's side using JavaScript and VBScript before the Web page is sent to the server."},{"tag":"p","original":" The server-side validation happens at the server side. ","result":"The process of server-side validation takes place on the server rather than the client."},{"tag":"p","original":"  File-based dependency:  File-based dependency facilitates you to save the dependency on a file in a disk. ","result":"One way to manage dependencies is through file-based dependency, which allows for storing dependencies in a file on a disk."},{"tag":"p","original":"  Key-based dependency:  In key-based dependency, you depend on another cached item. ","result":"Key-based dependency refers to a type of dependency where you rely on a previously cached item."},{"tag":"p","original":"  Globalization:  Globalization is a technique to identify the part of a Web application that is different for different languages and separate it out from the web application. ","result":"Globalization is a process employed to recognize the elements of a web application that vary based on different languages and to segregate them from the main web application."},{"tag":"p","original":"  Localization:  In localization, you try to configure a Web application so that it can be supported for a specific language or locale. ","result":"Localization involves customizing a website or application to make it compatible with a specific language or area. The goal is to adapt the content and functionality to cater to the needs of users in a particular region."},{"tag":"p","original":"  Page Theme:  The page theme is applied to particular web pages of the project. It is stored inside a subfolder of the App_Themes folder. ","result":"The page theme is a specific visual design that is assigned to individual web pages within a project. It is located in a subdirectory of the App_Themes folder."},{"tag":"p","original":"  Global Theme:  The Global theme is applied to all the web applications on the web server. It is stored inside the Themes folder on a Web server. ","result":"The Global theme is a design that is applied to every web application hosted on a web server. It is housed within the Themes folder of the server."},{"tag":"p","original":"  Early Binding:  In early binding, a non-virtual method is called which is decided at a compile time. ","result":"Early binding refers to the process of calling a non-virtual method that is determined during the compile time. It is a way of resolving functions and variables during the compilation process itself."},{"tag":"p","original":"  Late Binding:  In late binding, a virtual method is called which is decided at runtime. ","result":"Late binding refers to the process of calling a virtual method at runtime, where the specific method to be called is determined dynamically."},{"tag":"p","original":"  Server-side scripting:  In server-side scripting, all the script are executed by the server and interpreted as needed. ","result":"Server-side scripting refers to the execution of scripts on a server, where they are interpreted as required. This is in contrast to client-side scripting, where scripts are executed by the user's browser."},{"tag":"p","original":"  Client-side scripting:  In client-side scripting, the script will be executed immediately in the browser such as form field validation, email validation, etc. ","result":"Client-side scripting is the execution of scripts in the user's browser. It is used to perform tasks such as validation of form fields and email addresses. The scripts are executed instantly to provide an interactive and quick experience for the users."},{"tag":"p","original":" The client-side scripting is usually carried out in VBScript or JavaScript. ","result":"The implementation of scripts on the client-side is typically executed using either VBScript or JavaScript."},{"tag":"p","original":"  FormsAuthentication.Signout()  method is used to sign out from forms authentication. ","result":"To log out from forms authentication, the \"FormsAuthentication.Signout()\" method is utilized."},{"tag":"p","original":"  By the help of  ValidationSummary  control, we can display all validation messages in one control. ","result":"The ValidationSummary control is used to display multiple validation messages in a single control."},{"tag":"p","original":" Authentication is a process of identifying user whereas authorization is used to check the access rights of an identified user. ","result":"The process of authentication involves verifying the identity of a user, while authorization is used to determine if an identified user has access rights or permissions."},{"tag":"p","original":" ViewState is a feature of ASP.NET to store the values of a page before it is submitted to the server. After posting the page, data from is ViewState is restored. ","result":"ViewState is an essential aspect of ASP.NET that enables the storage of page values. This data is saved before the page is sent to the server. Upon submission, the information stored in ViewState is retrieved and restored."},{"tag":"p","original":" It is stored in HTML hidden field. ","result":"The information is saved in an invisible HTML field."},{"tag":"p","original":"  Response.Write()  is used for normal output whereas  Response.Output.Write()  is used for formatted output. ","result":"One method for generating output in ASP.NET is through the use of Response.Write(). However, for formatted output, Response.Output.Write() is often used instead."},{"tag":"p","original":" There are two types of configuration files: ","result":"There exist two distinct categories of files utilized for configuration:"},{"tag":"li","original":" Application Level config = Web.config. ","result":"The configuration file used at the application level is commonly known as Web.config."},{"tag":"li","original":" Machine Level config = Machine.config. ","result":"The configuration specific to the machine is referred to as Machine.config."},{"tag":"p","original":" Web config file is specific to web application whereas Machine config file is specific to machine or server. ","result":"The web.config file is tailored to a specific web application, while the machine.config file is tailored to a server or machine."},{"tag":"p","original":" There can be multiple web config files in an application but only one machine config file. ","result":"An application can contain several web config files, but there can only be one machine config file in an application."},{"tag":"p","original":" MVC stands for Model View Controller. It is a design pattern that is used to separate business logic and presentation logic. It is used to develop the highly customized application. ","result":"The term MVC refers to Model View Controller, which is a software design pattern utilized for separating presentation logic and business logic. It is an effective approach for building customized applications."},{"tag":"p","original":" The Model represents data, View represents presentation and controller acts as an interface between Model and View. ","result":"The concept of Model-View-Controller (MVC) architecture is based on separating an application into three interconnected components: Model, View, and Controller. The Model component is responsible for data management, the View component handles presentation, and the Controller acts as a mediator between the Model and View components."},{"tag":"p","original":" The major built-in objects are given below: ","result":"Here are some of the primary objects that are integrated into the system:"},{"tag":"p","original":" Role-based security is used in almost all organization, and the Role-based security assigns certain privileges to each role. ","result":"Nearly every organization employs role-based security to organize its system. Each role is assigned specific privileges through role-based security."},{"tag":"li","original":" Each user is assigned a particular role from the list. ","result":"Every individual user is granted a specific role from the available options."},{"tag":"li","original":" Privileges as per role restrict the user's actions on the system and ensure that a user can do only what he is permitted to do on the system. ","result":"The privileges assigned to a user's role determine their level of access within the system. These privileges limit a user's actions to only those that are authorized for their specific role, ensuring that they cannot perform tasks outside of their designated responsibilities."},{"tag":"p","original":" A Cookie is a small piece of information which is stored at the client side. There are two types of cookie: ","result":"A cookie is a piece of data that is saved on the client-side. These small bits of information come in two different types."},{"tag":"li","original":" Session/Temporary Cookie: valid for a single session ","result":"A temporary cookie or session cookie is only valid for one browsing session and is deleted when you close your browser."},{"tag":"li","original":" Persistent Cookie: valid for multiple session ","result":"A persistent cookie remains valid for more than one browsing session."},{"tag":"p","original":" You have to follow the procedures given below: ","result":"In order to ensure compliance, it is necessary to adhere to the following instructions:"},{"tag":"li","original":" Use the \"Cookie.Discard\" property. ","result":"To prevent cookies from being sent back to the server, you can make use of the \"Cookie.Discard\" attribute."},{"tag":"li","original":" It gets or sets the discard flag set by the server. ","result":"The discard flag, which is determined by the server, can be retrieved or updated using this function."},{"tag":"li","original":" When set to true, this property instructs the client application not to save the Cookie on the hard disk of the user at the end of the session. ","result":"If this property is enabled, the client application will not save the Cookie on the user's hard drive after the session ends."},{"tag":"p","original":" The File extension of web service is .asmx. ","result":"The file format for web service is identified by the extension .asmx."},{"tag":"li","original":" HTML server controls are just like HTML elements that we use on the HTML pages. ","result":"HTML server controls function similarly to the regular HTML elements seen on web pages."},{"tag":"li","original":" HTML server controls are used to expose properties and events for use.  ","result":"HTML server controls allow for the exposure of various properties and events for usage in web development."},{"tag":"li","original":" To make these controls programmatically accessible, we specify that the HTML controls act as a server control by adding the runat=\"server\" attribute. ","result":"We can enable programmatically accessible controls in HTML by declaring them as server controls using the \"runat='server'\" attribute."},{"tag":"p","original":" The Global.asax file is used to execute the application-level events and sets application-level variables. ","result":"The Global.asax file is utilized to trigger the events at the application-level and establish variables that are specific to the application."},{"tag":"p","original":" When child control sends events to parent, it is termed as event bubbling. Server controls like Data Grid, Data List, and Repeater can have other child controls inside them. ","result":"Event bubbling is the term used to describe when child controls send events to their parent controls. Many server controls, such as Data Grid, Data List, and Repeater, have child controls nested inside them."},{"tag":"span","original":" SQL Server Interview Questions ","result":"Here are some interview questions for SQL Server.\n\n1. What is SQL Server?\n2. What is the difference between clustered and non-clustered indexes?\n3. What is the purpose of normalization in database design?\n4. What are the different types of joins in SQL?\n5. How would you optimize a slow-performing query?\n6. What are the benefits of using stored procedures in Sql Server?\n7. How does Sql Server handle concurrency violations?\n8. What are the different backup and restore strategies in SQL Server?\n9. What is a deadlock and how can it be avoided?\n10. What is the purpose of the SQL Server Agent service?\n\nThese interview questions can be helpful for candidates applying for SQL Server roles."},{"tag":"a","original":" Java Basics Interview Questions ","result":"Below are some sample Java Basics Interview Questions that could help prepare for a job interview in Java programming. The questions cover fundamental Java concepts such as data types, variables, control structures, and object-oriented programming."},{"tag":"a","original":" Java OOPs Interview Questions ","result":"Below are some sample interview questions related to Object-Oriented Programming (OOPs) concepts in Java."},{"tag":"a","original":" Spring Boot Interview Questions ","result":"Here are some commonly asked questions during a Spring Boot interview."},{"tag":"a","original":" C Programming Interview Questions ","result":"Please provide the original content that needs to be rephrased."},{"tag":"a","original":" Data Structure Interview Questions ","result":"Here are some interview questions related to data structures."},{"tag":"a","original":" Manual Testing Interview Questions ","result":"How to ask questions during a manual testing interview.\n\nManual Testing interviews require continuous learning and preparation. You must take charge of the conversation and learn how to ask insightful questions to stand out from other candidates.\n\nSome questions you should consider asking include:\n- What types of testing methodologies are being used?\n- Has the team ever dealt with a particularly difficult bug? If so, how was it resolved?\n- How do you manage your test cases and document test results?\n- What tools does the team use for testing?\n- How do you ensure that the product is being tested thoroughly?\n- What kind of training do you provide for your team members?\n\nAsking well-thought-out questions will showcase your initiative and depth of knowledge, while also demonstrating your enthusiasm for the role."}]