[{"tag":"p","original":" PL/SQL is an advance version of SQL. There are given top list of PL/SQL interview questions with answer. ","result":"Here are some top PL/SQL interview questions and their answers. PL/SQL is an advanced version of SQL."},{"tag":"p","original":" PL/SQL stands for procedural language extension to SQL. It supports procedural features of programming language and SQL both. It was developed by Oracle Corporation in early of 90's to enhance the capabilities of SQL. ","result":"PL/SQL is an acronym for Procedural Language extension to SQL. It offers support for both SQL and programming language functionalities. In the early 1990s, Oracle Corporation introduced this language to enhance SQL's capabilities."},{"tag":"p","original":" PL/SQL is an extension of SQL. While SQL is non-procedural, PL/SQL is a procedural language designed by Oracle. It is invented to overcome the limitations of SQL. ","result":"PL/SQL is a procedural language created by Oracle that extends the capabilities of SQL. Unlike SQL, which is non-procedural, PL/SQL is designed for programming tasks and offers various features to overcome the limitations of SQL."},{"tag":"p","original":" A list of some notable characteristics:  ","result":"Here are some noteworthy traits:"},{"tag":"li","original":" PL/SQL is a block-structured language. ","result":"PL/SQL is a programming language that is structured in blocks."},{"tag":"li","original":" It is portable to all environments that support Oracle. ","result":"The software can be used in any environment that is compatible with Oracle, making it highly versatile and portable."},{"tag":"li","original":" PL/SQL is integrated with the Oracle data dictionary. ","result":"PL/SQL has seamless integration with the data dictionary of Oracle."},{"tag":"li","original":" Stored procedures help better sharing of application. ","result":"Using stored procedures in an application allows for improved sharing of code across various components of the application."},{"tag":"p","original":" Objects of type tables are called PL/SQL tables that are modeled as database table. We can also say that PL/SQL tables are a way to providing arrays. Arrays are like temporary tables in memory that are processed very quickly. PL/SQL tables are used to move bulk data. They simplifies moving collections of data. ","result":"PL/SQL tables are a data type which can be described as objects of tables that exhibit behavior similar to database tables. Essentially, PL/SQL tables are used as a means of providing arrays that facilitate the processing of large amounts of data. These tables can be thought of as temporary data structures residing in memory that operate at a much faster pace than traditional database tables. As a result, they're an efficient way to move collections of data."},{"tag":"p","original":" There are two types of datatypes in PL/SQL: ","result":"PL/SQL has two categories of datatypes."},{"tag":"p","original":" PL/SQL uses BLOCK structure as its basic structure. Each PL/SQL program consists of SQL and PL/SQL statement which form a PL/SQL block. ","result":"A fundamental structure used in PL/SQL programming is the BLOCK structure which is comprised of both SQL and PL/SQL statements. Every PL/SQL program is made up of one or more PL/SQL blocks."},{"tag":"p","original":" PL/SQL block contains 3 sections. ","result":"The PL/SQL block is made up of three distinct sections."},{"tag":"li","original":" The Declaration Section (optional) ","result":"The Declaration section is an optional part of a document where the author can state their intentions or beliefs related to the topic at hand."},{"tag":"li","original":" The Execution Section (mandatory) ","result":"Sure, below is the rephrased content without plagiarism:\n\nThe Execution Section is crucial to the success of a project and is mandatory for every project plan. This section outlines how the project will be carried out and sets the foundation for the project's implementation. It includes details such as the project timeline, the team's responsibilities, and the resources required. Without a well-defined Execution Section, a project may fail due to lack of direction and guidance. Therefore, it is necessary to give serious consideration to this section when developing a project plan."},{"tag":"li","original":" The Exception handling Section (optional) ","result":"The section on Exception handling is not compulsory and is usually included in programming where there is a possibility of errors occurring during the execution of a program."},{"tag":"p","original":"  Function : The main purpose of a PL/SQL function is generally to compute and return a single value. A function has a return type in its specification and must return a value specified in that type. ","result":"A PL/SQL function is designed to perform computations and return a value based on that computation. Its main objective is to provide a single value output, which must match the specified return type mentioned in its specification."},{"tag":"p","original":"  Procedure : A procedure does not have a return type and should not return any value but it can have a return statement that simply stops its execution and returns to the caller. A procedure is used to return multiple values otherwise it is generally similar to a function. ","result":"A procedure is a type of function that does not return a value, but may include a return statement to abruptly end its execution and return control to the caller. It is commonly used to return multiple values and is otherwise similar to a function."},{"tag":"p","original":"  Package : A package is schema object which groups logically related PL/SQL types , items and subprograms. You can also say that it is a group of functions, procedure, variables and record type statement. It provides modularity, due to this facility it aids application development. It is used to hide information from unauthorized users. ","result":"A package is a fundamental schema object in PL/SQL that is used to organize related types, items, and subprograms logically. Essentially, it is a collection of procedures, functions, record type statements, and variables that are grouped together to provide modularity, enhance application development, and safeguard information from unauthorized users."},{"tag":"p","original":" Exception is an error handling part of PL/SQL. There are two type of exceptions: pre_defined exception and user_defined exception. ","result":"Exceptions are a crucial part of PL/SQL used for handling errors. There are two types of exceptions - pre-defined ones and ones defined by the user."},{"tag":"p","original":" Greeting := 'Hello' || 'World';  ","result":"Create a greeting by combining the words \"Hello\" and \"World\"."},{"tag":"p","original":" No. PL/SQL doesn't support the data definition commands like CREATE. ","result":"PL/SQL does not have the capability to execute data definition commands such as CREATE."},{"tag":"p","original":" A function returns a value while a stored procedure doesn?t return a value. ","result":"In programming, there is a distinction between functions and stored procedures based on their ability to return a value. While functions return a value after executing, stored procedures do not."},{"tag":"p","original":" Whenever an Error occurs Exception arises. Error is a bug whereas exception is a warning or error condition. ","result":"The occurrence of an error leads to the emergence of an exception. An error is a mistake, whereas an exception is a condition or warning of an error."},{"tag":"p","original":" Faster access of data blocks in the table. ","result":"Enhanced efficiency in retrieving data blocks from a table."},{"tag":"p","original":" You can declare the User defined exceptions under the DECLARE section, with the keyword EXCEPTION. ","result":"To declare User-defined exceptions in SQL, you can use the EXCEPTION keyword under the DECLARE section."},{"tag":"p","original":" A list of predefined exceptions in PL/SQL: ","result":"The following are some commonly used exceptions already defined in PL/SQL that can be used by developers."},{"tag":"p","original":" A trigger is a PL/SQL program which is stored in the database. It is executed immediately before or after the execution of INSERT, UPDATE, and DELETE commands. ","result":"A trigger is a type of PL/SQL code that is saved within a database and is designed to run either before or after certain database events such as INSERT, UPDATE, or DELETE commands. Its purpose is to facilitate the automation of specific actions or processes within the database."},{"tag":"p","original":" There are 12 types of triggers in PL/SQL that contains the combination of BEFORE, AFTER, ROW, TABLE, INSERT, UPDATE, DELETE and ALL keywords. ","result":"PL/SQL has a total of 12 different types of triggers that use a combination of keywords such as BEFORE, AFTER, ROW, TABLE, INSERT, UPDATE, DELETE, and ALL."},{"tag":"li","original":" BEFORE ALL ROW INSERT ","result":"Reworded: \n\"Prior to inserting any rows\""},{"tag":"li","original":" AFTER ALL ROW INSERT ","result":"One way to rephrase the content could be: Adding rows to a database table can be done in a number of ways, depending on the specific database system being used. Once the rows have been inserted, it's important to verify that they were added successfully and to check that the data is accurate. Only then can you be confident that the database is functioning correctly."},{"tag":"p","original":" A trigger is automatically executed without any action required by the user, while, a stored procedure is explicitly invoked by the user. ","result":"A trigger is a type of program that is designed to automatically run in response to certain database events or changes, without requiring any action from the user. In contrast, a stored procedure is a program that is explicitly invoked by a user to carry out a specific database function or operation."},{"tag":"p","original":" When a trigger is associated to a view, the base table triggers are normally enabled. ","result":"When a view is linked to a trigger, the triggers of the underlying table are typically activated."},{"tag":"p","original":" A WHEN clause specifies the condition that must be true for the trigger to be triggered. ","result":"To activate a trigger, a WHEN clause sets the requirement that must be met."},{"tag":"p","original":" ALTER TRIGGER update_salary DISABLE; ","result":"Modify the update_salary trigger to disable it."},{"tag":"p","original":" Table columns are referred as THEN.column_name and NOW.column_name. ","result":"The columns in a table can be identified using the syntax \"THEN.column_name\" and \"NOW.column_name\"."},{"tag":"p","original":" For INSERT related triggers, NOW.column_name values are available only. ","result":"Triggers that are related to INSERT operations only have access to the values of the column specified by NOW.column_name."},{"tag":"p","original":" For DELETE related triggers, THEN.column_name values are available only. ","result":"When creating DELETE triggers, you can only access the THEN.column_name values in the trigger. Other values and information may not be available."},{"tag":"p","original":" For UPDATE related triggers, both Table columns are available. ","result":"Triggers related to UPDATE operations can access both columns of the corresponding Table."},{"tag":"p","original":" A stored procedure is a sequence of statement or a named PL/SQL block which performs one or more specific functions. It is similar to a procedure in other programming languages. It is stored in the database and can be repeatedly executed. It is stored as schema object. It can be nested, invoked and parameterized. ","result":"Essentially, a stored procedure is a series of statements or a named block of PL/SQL code that is designed to carry out a specific task or tasks. Much like a procedure in other programming languages, stored procedures are stored in a database, and can be executed multiple times. They are saved as an object within a schema and can be used with parameters and recursive logic."},{"tag":"li","original":" Stored procedures and functions ","result":"Rewording: \n\nStored procedures and functions are commonly used programming constructs in databases. They provide a way to group multiple SQL statements into a single, reusable block of code that can be executed multiple times. Stored procedures are often used for complex database operations that require several SQL statements to be executed in sequence. Functions, on the other hand, are used to perform computations and return a single value. Both stored procedures and functions offer the benefit of improving performance by reducing network traffic and reducing the need for repetitive coding."},{"tag":"p","original":" Oracle uses workspaces to execute the SQL commands. When Oracle processes a SQL command, it opens an area in the memory called Private SQL Area. This area is identified by the cursor. It allows programmers to name this area and access it?s information. ","result":"Workspaces are utilized by Oracle for executing SQL commands. Private SQL Area, which is a memory space, is launched by Oracle to process SQL instructions, with the cursor functioning as its identifier. This function permits developers to specify the area by name to obtain its information."},{"tag":"p","original":" Implicit cursor is implicitly declared by Oracle. This is a cursor to all the DDL and DML commands that return only one row. ","result":"Oracle provides an implicit cursor which is automatically declared when executing certain DDL and DML commands that return only a single row. This cursor is not explicitly declared in the code but can still be used to fetch the data returned by these commands."},{"tag":"p","original":" Explicit cursor is created for queries returning multiple rows. ","result":"An explicit cursor is used in cases where a query returns multiple rows."},{"tag":"p","original":" The cursor attribute SQL%ROWCOUNT will return the number of rows that are processed by a SQL statement. ","result":"The SQL%ROWCOUNT attribute of the cursor can be used to obtain the count of rows affected by a SQL statement."},{"tag":"p","original":" It returns the Boolean value TRUE if at least one row was processed. ","result":"The function returns a result of TRUE as long as one row has undergone processing."},{"tag":"p","original":" It returns the Boolean value TRUE if no rows were processed. ","result":"The function will output a TRUE value indicating that there were no rows processed."},{"tag":"p","original":" A PL/SQL package can be specified as a file that groups functions, cursors, stored procedures, and variables in one place. ","result":"A package in PL/SQL is a collection of stored procedures, functions, and variables grouped together in a single file, making it easier to manage and access them."},{"tag":"p","original":" PL/SQL packages have the following two parts:  ","result":"PL/SQL packages consist of two main components:"},{"tag":"p","original":"  Specification part:  It specifies the part where the interface to the application is defined. ","result":"This refers to the section of a software design where the definition of the interface to the application is outlined."},{"tag":"p","original":"  Body part:  This part specifies where the implementation of the specification is defined.  ","result":"This section outlines the location of the implementation of the specification."},{"tag":"p","original":" The DROP PACKAGE command is used to delete a package. ","result":"The command \"DROP PACKAGE\" is utilized to eradicate a package from a system."},{"tag":"p","original":" There are two way to execute a stored procedure. ","result":"There exist two methods of performing a stored procedure."},{"tag":"p","original":" From the SQL prompt, write EXECUTE or EXEC followed by procedure_name. ","result":"Here's a possible rephrased version: \n\nTo execute a stored procedure in SQL, you can use the keyword EXECUTE or its shorthand EXEC, followed by the name of the procedure you want to run. This command will run the code contained in the procedure and return any output specified in the procedure's definition."},{"tag":"p","original":" Simply use the procedure name ","result":"The suggested approach is to utilize the name of the process."},{"tag":"p","original":" Modularity, extensibility, reusability, Maintainability and one time compilation. ","result":"There are several key characteristics that make for a successful software program, including its modularity, extensibility, reusability, maintainability, and the ability for one-time compilation. All of these elements are essential in ensuring that a software program can be easily developed, modified, and maintained over time, while also providing a consistent user experience. By focusing on these key characteristics, developers can create software that is both effective and sustainable in the long run."},{"tag":"p","original":"  %ISOPEN : it checks whether the cursor is open or not. ","result":"The function %ISOPEN can be utilized to verify whether a cursor is currently open or not."},{"tag":"p","original":"  %ROWCOUNT : returns the number of rows affected by DML operations: INSERT,DELETE,UPDATE,SELECT. ","result":"The ROWCOUNT function is used to determine the number of rows that have been impacted by actions such as INSERT, DELETE, UPDATE, and SELECT in database management systems."},{"tag":"p","original":"  %FOUND : it checks whether cursor has fetched any row. If yes - TRUE. ","result":"The function \"FOUND\" is used to determine if any rows have been fetched by the cursor. It returns a boolean value of TRUE if at least one row has been fetched, otherwise it returns FALSE."},{"tag":"p","original":"  %NOTFOUND : it checks whether cursor has fetched any row. If no - TRUE. ","result":"The \"NOTFOUND\" attribute in cursor management is a Boolean value that indicates whether the cursor has retrieved any rows or not. It returns TRUE if no rows have been fetched, otherwise FALSE. This feature is useful in control statements for iterating over results from a cursor."},{"tag":"p","original":" A syntax error can be easily detected by a PL/SQL compiler. For example: incorrect spelling etc. while, a runtime error is handled with the help of exception-handling section in a PL/SQL block. For example: SELECT INTO statement, which does not return any rows. ","result":"PL/SQL compiler can identify syntax errors while executing a program such as errors with spelling. In contrast, runtime errors are resolved using exception-handling techniques in a PL/SQL block. This type of error occurs due to issues like SELECT INTO statement not returning any rows."},{"tag":"p","original":" Following conditions are true for the Commit statement:  ","result":"The Commit statement has the following criteria:"},{"tag":"li","original":" Other users can see the data changes made by the transaction. ","result":"The alterations made to the data by a transaction are visible to all other users."},{"tag":"li","original":" The locks acquired by the transaction are released. ","result":"The transaction relinquishes its hold on the locks."},{"tag":"li","original":" The work done by the transaction becomes permanent. ","result":"The effects of the transaction are usually irreversible and will have a lasting impact on the parties involved."},{"tag":"p","original":" The Rollback statement is issued when the transaction ends. Following conditions are true for a Rollback statement: ","result":"The Rollback statement should be executed at the conclusion of a transaction. The Rollback statement has specific requirements that must be met, including:"},{"tag":"li","original":" The work done in a transition is undone as if it was never issued. ","result":"When a transition is reversed, it cancels out the effect of the original transition, essentially erasing it from the record."},{"tag":"li","original":" All locks acquired by transaction are released. ","result":"Once a transaction is completed, the locks that were acquired during the transaction are all released."},{"tag":"p","original":" With SAVEPOINT, only part of transaction can be undone. ","result":"The use of SAVEPOINT in transactions allows for only a portion of the changes made to be undone, rather than the entire transaction."},{"tag":"p","original":" Mutating table error is occurred when a trigger tries to update a row that it is currently using. It is fixed by using views or temporary tables. ","result":"The error \"mutating table\" occurs when a trigger attempts to modify a row that it is currently accessing. This can be resolved by utilizing temporary tables or views."},{"tag":"p","original":" Consistency simply means that each user sees the consistent view of the data. ","result":"Consistency refers to the idea that all users should be able to view the same, uniform version of the data."},{"tag":"p","original":" Consider an example: there are two users A and B. A transfers money to B's account. Here the changes are updated in A's account (debit) but until it will be updated to B's account (credit), till then other users can't see the debit of A's account. After the debit of A and credit of B, one can see the updates. That?s consistency. ","result":"Let's take an example of two users, A and B, where A sends some money to B's account. The changes will first be updated in A's account as a debit, but until the credit is updated to B's account, no other users will be able to see the debit of A's account. Once the credit of B is updated, the changes will become visible. This is what we call consistency in accounting."},{"tag":"p","original":"  A cursor is a  temporary work area  created in a system memory when an SQL statement is executed. ","result":"When an SQL statement is executed, a cursor is formed in the memory of the system for temporary use."},{"tag":"p","original":" A cursor contains information on a select statement and the row of data accessed by it. This temporary work area stores the data retrieved from the database and manipulate this data. A cursor can hold more than one row, but can process only one row at a time. Cursor are required to process rows individually for queries. ","result":"A cursor is a tool used to retrieve and manage data in a temporary work area. It stores information on a select statement and the accessed data row from a database. Cursors are essential for processing each row individually in queries, since they can contain more than one row but only handle one row at a time."},{"tag":"p","original":" There are two types of cursors in PL/SQL. ","result":"PL/SQL has two distinct types of cursors."},{"tag":"a","original":" Java Basics Interview Questions ","result":"Please provide the content to be rephrased."},{"tag":"a","original":" Java OOPs Interview Questions ","result":"Please provide the original content for me to rephrase."},{"tag":"a","original":" Java Multithreading Interview Questions ","result":"The following set of questions pertains to multithreading in the Java programming language. These are commonly asked during Java multithreading interviews."},{"tag":"a","original":" Java String &amp; Exception Interview Questions ","result":"Below are some interview questions related to Java on the topics of Strings and Exceptions. These questions can help assess a candidate's knowledge and understanding of these key areas."},{"tag":"a","original":" Java Collection Interview Questions ","result":"Here are some interview questions about Java Collection."},{"tag":"span","original":" SQL Server Interview Questions ","result":"Here are some commonly asked SQL Server interview questions that may be helpful in preparing for a job interview related to this field. These questions cover various aspects of SQL Server and can help you gain insights into the specific areas that a potential employer may be interested in."},{"tag":"a","original":" Spring Boot Interview Questions ","result":"The following questions are related to interviews for Spring Boot."},{"tag":"a","original":" C Programming Interview Questions ","result":"Below are some potential interview questions related to the C programming language."},{"tag":"a","original":" Data Structure Interview Questions ","result":"Sure! Here's a rephrased version: \n\nInterviewers often ask questions related to data structures to assess a candidate's ability to solve complex problems efficiently. These questions can range from defining various data structures to implementing them and using them to solve problems. It is important to have a strong understanding of data structures and their various operations and complexities to excel in such interviews."},{"tag":"a","original":" Manual Testing Interview Questions ","result":"Please provide me with a list of common interview questions related to manual testing. I need the questions to prepare for an upcoming manual testing interview."}]